{
	"required_tags": {
		"name": "RequiredTags",
		"description": "Checks whether your resources have the tags that you specify",
		"severity": "Low"
	},
	"flow_logs_enabled": {
		"name": "VPCFlowLogsEnabled",
		"description": "Enable VPC flow logs on organization level",
		"severity": "High"
	},
	"ec2_instance_in_vpc": {
		"name": "EC2InstanceInVPC",
		"description": "Checks whether EC2 instances belong to a virtual private cloud (VPC).",
		"severity": "High"
	},
	"rds_instance_public_access_check": {
		"name": "RDSPublicAccessCheck",
		"description": "Check RDS instances are not publicly accessible",
		"severity": "Medium"
	},
	"rds_snapshots_public_prohibited": {
		"name": "RDSSnapshotsPublicProhibited",
		"description": "Check RDS snapshot are not publicly accessible",
		"severity": "High"
	},
	"check_encrypted_volume": {
		"name": "CheckEncryptedVolumes",
		"description": "Check whether the EBS volumes that are in an attached state are encrypted.",
		"severity": "Medium"
	},
	"ec2_instance_no_public_ip": {
		"name": "EC2InstanceNoPublicIP",
		"description": "Check EC2 instance does not have an assigned public ip",
		"severity": "High"
	},
	"elb_logging_enabled": {
		"name": "ELBLoggingEnabled",
		"description": "Check that logging is enabled on load balancer",
		"severity": "Medium"
	},
	"rds_storage_encryption_enabled": {
		"name": "RDSStorageEncryption",
		"description": "Check that RDS storage is encrypted",
		"severity": "High"
	},
	"iam_root_access_key_check": {
		"name": "IAMRootAccessKeyCheck",
		"description": "Checks whether the root user access key is available. The rule is COMPLIANT if the user access key does not exist",
		"severity": "High"
	},
	"ebs_snapshot_public_restorable_check": {
		"name": "EBSSnapshotPublicRestorableCheck",
		"description": "Checks whether Amazon Elastic Block Store snapshots are not publicly restorable. The rule is NON_COMPLIANT if one or more snapshots with the RestorableByUserIds field is set to all. If this field is set to all, then Amazon EBS snapshots are public.",
		"severity": "Medium"
	},
	"redshift_cluster_public_access_check": {
		"name": "RedshiftClusterPublicAccessCheck",
		"description": "Checks whether Amazon Redshift clusters are not publicly accessible. The rule is NON_COMPLIANT if the publiclyAccessible field is true in the cluster configuration item.",
		"severity": "Low"
	},
	"acm-certificate-expiration-check": {
		"name": "ACMCertificateExpirationCheck",
		"description": "Checks whether ACM Certificates in your account are marked for expiration within 90 days.",
		"severity": "High"
	},
	"s3-bucket-public-read-prohibited": {
		"name": "S3BucketPublicReadProhibited",
		"description": "Checks that your Amazon S3 buckets do not allow public read access. The rule checks the Block Public Access settings, the bucket policy, and the bucket access control list (ACL).",
		"severity": "Medium"
	},
	"s3-bucket-public-write-prohibited": {
		"name": "S3BucketPublicWriteProhibited",
		"description": "Checks that your Amazon S3 buckets do not allow public write access. The rule checks the Block Public Access settings, the bucket policy, and the bucket access control list (ACL).",
		"severity": "Low"
	},
	"s3-bucket-server-side-encryption-enabled": {
		"name": "S3BucketServerSideEncryptionEnabled",
		"description": "Checks that your Amazon S3 bucket either has Amazon S3 default encryption enabled or that the S3 bucket policy explicitly denies put-object requests without server side encryption.",
		"severity": "High"
	},
	"s3-bucket-ssl-requests-only": {
		"name": "S3BucketSSLRequestsOnly",
		"description": "Checks whether S3 buckets have policies that require requests to use Secure Socket Layer (SSL).",
		"severity": "Medium"
	},
	"restricted-incoming-traffic-common-ports": {
		"name": "RestrictedCommonPorts",
		"description": "Checks if the security groups in use do not allow unrestricted incoming TCP traffic to the specified ports. The rule is COMPLIANT when IP addresses of the incoming SSH traffic in the security group are restricted to specified ports.",
		"severity": "Medium"
	},
	"vpc-sg-open-only-to-authorized-ports": {
		"name": "VPCSecurityGroupOpenOnlyToAuthorizedPorts",
		"description": "Checks whether the security group with 0.0.0.0/0 of any Amazon VPC allows only specific inbound TCP or UDP traffic. The rule is NON_COMPLIANT if a security group with inbound 0.0.0.0/0. with no ports provided in the parameters.",
		"severity": "High"
	},
	"vpc-vpn-2-tunnels-up": {
		"name": "VpcVpn2TunnelsIp",
		"description": "Checks that both AWS Virtual Private Network tunnels provided by AWS Site-to-Site VPN are in UP status. The rule returns NON_COMPLIANT if one or both tunnels are in DOWN status.",
		"severity": "High"
	},
	"access-keys-rotated": {
		"name": "AccessKeysRotated",
		"description": "Checks whether the active access keys are rotated within the number of days specified in maxAccessKeyAge. The rule is NON_COMPLIANT if the access keys have not been rotated for more than maxAccessKeyAge number of days.",
		"severity": "High"
	},
	"vpc-default-security-group-closed": {
		"name": "VpcDefaultSecurityGroupClosed",
		"description": "Checks the default security grp of any VPC does not allow inbound or outbound traffic. The rule is NON_COMPLIANT if the default security group has one or more inbound or outbound traffic.",
		"severity": "Medium"
	},
	"restricted-ssh": {
		"name": "IncomingSSHDisabled",
		"description": "Checks whether the incoming SSH traffic for the security groups is accessible. The rule is COMPLIANT when IP addresses of the incoming SSH traffic in the security groups are restricted. This rule applies only to IPv4.",
		"severity": "High"
	},
	"multi-region-cloud-trail-enabled": {
		"name": "MultiRegionCloudTrailEnabled",
		"description": "Checks that there is at least one multi-region AWS CloudTrail. The rule is NON_COMPLIANT if the trails do not match inputs parameters.",
		"severity": "Low"
	}
}
